[
    {
        "category": {
            "category_name": "News & Views",
            "category_description": "",
            "category_link": "https://commons.commondreams.org/c/news-views/5",
            "num_topics": "85032"
        },
        "topics": [
            {
                "topic_details": {
                    "topic_title": "About the News & Views category",
                    "topic_id": "64670",
                    "topic_url": "https://commons.commondreams.org/t/about-the-news-views-category/64670",
                    "topic_author": "Craig_Brown",
                    "topic_author_link": "https://commons.commondreams.org/u/Craig_Brown",
                    "created_timestamp": "Jun 17, 2019 3:58 pm",
                    "replies": "34",
                    "views": "1433",
                    "users": "12",
                    "likes": "30",
                    "popular_links_attached": []
                },
                "posts": [
                    {
                        "post_id": "1",
                        "post_link": "https://commons.commondreams.org/t/about-the-news-views-category/64670",
                        "post_author": "Craig_Brown",
                        "post_author_link": "https://commons.commondreams.org/u/Craig_Brown",
                        "post_description": "(Replace this first paragraph with a brief description of your new category. This guidance will appear in the category selection area, so try to keep it below 200 characters.)\nUse the following paragraphs for a longer description, or to establish category guidelines or rules:\nWhy should people use this category? What is it for?\nHow exactly is this different than the other categories we already have?\nWhat should topics in this category generally contain?\nDo we need this category? Can we merge with another category, or subcategory?",
                        "post_description_links": [],
                        "post_replies": "1 Reply",
                        "post_likes": "0",
                        "linked_posts": []
                    },
                    {
                        "post_id": "2",
                        "post_link": "https://commons.commondreams.org/t/about-the-news-views-category/64670/2",
                        "post_author": "bluevote",
                        "post_author_link": "https://commons.commondreams.org/u/bluevote",
                        "post_description": "Uh… Why is this at the top of the feed, and is this supposed to be available for public comment?\nJust saying. Delete my comment as you see fit.",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "0",
                        "linked_posts": []
                    },
                    {
                        "post_id": "3",
                        "post_link": "https://commons.commondreams.org/t/about-the-news-views-category/64670/3",
                        "post_author": "dpearl",
                        "post_author_link": "https://commons.commondreams.org/u/dpearl",
                        "post_description": "This seems to be an “About page” without any text. I wonder if the commentator community might use this thread to discuss an issue of our choice. @dara had a similar idea some time ago.\nMedicare for all and strategies to implement it?\nThird party organization or organizing within the Democratic party?\nThoughts?\nNote: to reach this thread click on “News & Views” in the upper right.",
                        "post_description_links": [
                            "https://commons.commondreams.org/u/dara"
                        ],
                        "post_replies": "1 Reply",
                        "post_likes": "1",
                        "linked_posts": []
                    },
                    {
                        "post_id": "4",
                        "post_link": "https://commons.commondreams.org/t/about-the-news-views-category/64670/4",
                        "post_author": "dara",
                        "post_author_link": "https://commons.commondreams.org/u/dara",
                        "post_description": "I’m game, but I could not find the link to this page by searching the home page and searching for\n“Views”. There is no clickable text called News & Views that I see. But even if there was, that isn’t going to funnel many people here (how you and @bluevote found it still escapes me). So it seems like people can only find this thread with an invite? Being limited to 5, I will add on this post:\n@Maineac, @minecritter, @1Nall, and though I have no idea of he is coming back, it is after Jan 1 now, so I hope @SkepticTank is willing to post though I would understand if he is bitter.\nOf the 2 possibilities you mention, I am more interested in M4A (should I stay with M4A or is MfA or MFA better? writing it out all the time seems tedious). But I don’t have any problem with anyone who wants to discuss anything on this thread.\nOn M4A, I am as you know still interested in #forcethevote. I listen to Jimmy Dore a lot and he is definitely not for everyone, but as they say, one should be able to judge an idea on its merits and not on whether one likes the person who came up with it. (My exception on this is if the idea is very complicated and I’m not going to be able to understand it in which case I will use a little “appeal to authority” if I like that authority and trust them - that doesn’t apply here). I haven’t heard anyone use the argument that Jimmy is bad, thus the idea is bad, but it is supposedly out there.\nI have signed on at ~https://forcethevote.org/ and only about 40k people have signed thus far. I wish it was a lot more and I wish more people from PNHP would sign on (in this post, there is a reference to Dr. Flowers advocating for it: ~https://commons.commondreams.org/t/in-secret-ballot-vote-house-democrats-overwhelmingly-deny-aoc-a-powerful-committee-seat/85222/109). I’ve heard Dr. Adam Gaffney some more now and I don’t think he’s as opposed to the idea as I first gathered. It’s kind of hard to keep up with Katie Halper’s content - conversations go on for many hours and I haven’t heard all of what Gaffney has said on these YouTube shows and I haven’t found a written piece by him on the topic. But I find AOC’s comment that the leaders of the movement haven’t asked for this annoying. Because 1) One leader clearly has, 2) a non-trivial number of people in the movement clearly feel differently and at least she can engage us (she could have showed up at the recent townhall which I wasn’t able to see yet, but I know she wasn’t there).\nAs far as the idea goes - as you know these are some of the previous points I’ve made which I repeat for this thread:\nIf there is another M4A related thing we want besides a floor vote, we should be demanding that too. I happen to think the floor vote is a significant thing and I’m not enthusiastic about state run single payer systems (though I would of course support trying if it happens in California which hasn’t been in the cards for us this far - I don’t think our current governor would do it either, but maybe his hand can be forced).\nThis ‘demand’ should really be phrased to Pelosi as “why do you care if you give us this?” There is no one (besides Dore) that I know of that thinks House, Senate, and Biden would go along with the plan we have now at this time (or in Biden’s case - ever). Pelosi can make her case of why she thinks it is a stupid idea and she can get her “opposing the left” cred which I assume she wants (it’s working for her thus far).\nA floor vote (and whatever discussion that goes along - if there were none and just a 5 min. vote, I don’t think I would care about this idea - but as I understand it, there will be discussion along with hopefully laying out basic funding scheme options which those that read Michael Pollin might now, but many don’t) will give us the following things:\na) It lays out clearly who is with us and who is against us (I hated GWB, but I do feel polarization on this issue is not a bad thing).\nb) It will get the idea into more people’s heads (well, we don’t control the media and I’m sure they’ll do their best to spin it against us, but I still think more exposure is helpful).\nc) On this point - I am not the most confident, but I think it will allow us to dig into financing details more and help frame future bills.\nIn general, I find the argument that it won’t pass besides the point. The idea is to be as ready as we can whenever it can pass (I assume 4 years is the soonest possible time frame, but I absolutely don’t want to wait 25 years - assuming I live that long).\nThanks for thinking of me!\nAnybody who posts - please add 5 more usernames you think might be interested.",
                        "post_description_links": [
                            "https://commons.commondreams.org/u/skeptictank",
                            "https://commons.commondreams.org/u/1nall",
                            "https://commons.commondreams.org/u/maineac",
                            "https://commons.commondreams.org/u/minecritter",
                            "https://commons.commondreams.org/u/bluevote"
                        ],
                        "post_replies": "3 Replies",
                        "post_likes": "2",
                        "linked_posts": []
                    },
                    {
                        "post_id": "5",
                        "post_link": "https://commons.commondreams.org/t/about-the-news-views-category/64670/5",
                        "post_author": "dara",
                        "post_author_link": "https://commons.commondreams.org/u/dara",
                        "post_description": "I caught a post by @Unmentionables that links to the townhall that I wasn’t able to watch live (thanks):\nit is at:\n~https://www.youtube.com/watch?v=FVyBHFn7hjw (content starts at 16 min 29 sec )",
                        "post_description_links": [
                            "https://commons.commondreams.org/u/unmentionables"
                        ],
                        "post_replies": "0 Reply",
                        "post_likes": "0",
                        "linked_posts": []
                    }
                ]
            },
            {
                "topic_details": {
                    "topic_title": "Welcome to The Commons @ Common Dreams",
                    "topic_id": "3480",
                    "topic_url": "https://commons.commondreams.org/t/welcome-to-the-commons-common-dreams/3480",
                    "topic_author": "CommonDreams",
                    "topic_author_link": "https://commons.commondreams.org/u/CommonDreams",
                    "created_timestamp": "Feb 4, 2015 9:12 am",
                    "replies": "2",
                    "views": "4078",
                    "users": "1",
                    "likes": "1",
                    "popular_links_attached": []
                },
                "posts": [
                    {
                        "post_id": "1",
                        "post_link": "https://commons.commondreams.org/t/welcome-to-the-commons-common-dreams/3480",
                        "post_author": "CommonDreams",
                        "post_author_link": "https://commons.commondreams.org/u/CommonDreams",
                        "post_description": "This News & Views category is automatically generated as new articles are published on the front page 50 of the Common Dreams website.\nThis forum contains the readers comments that appear at the bottom of each article on our website.\nWe recommend heading over to Common Dreams and taking a look at our front page, but if you prefer this method of reading headlines, there is a permalink to each article at the top of each comment thread that will take you back to the original article. Please take the time to read each article before commenting to ensure that you are able to most effectively participate in the comment thread.\nIn order to maintain a healthy community, moderators reserve the right to remove any content and any user account for any reason at any time. See: Community Guidelines",
                        "post_description_links": [
                            "http://www.commondreams.org/"
                        ],
                        "post_replies": "0 Reply",
                        "post_likes": "1",
                        "linked_posts": []
                    }
                ]
            },
            {
                "topic_details": {
                    "topic_title": "Decades of Disaster: Biden Is Right to End the War in Afghanistan",
                    "topic_id": "131192",
                    "topic_url": "https://commons.commondreams.org/t/decades-of-disaster-biden-is-right-to-end-the-war-in-afghanistan/131192",
                    "topic_author": "CommonDreams",
                    "topic_author_link": "https://commons.commondreams.org/u/CommonDreams",
                    "created_timestamp": "Aug 19, 2021 12:45 am",
                    "replies": "6",
                    "views": "114",
                    "users": "7",
                    "likes": "5",
                    "popular_links_attached": []
                },
                "posts": [
                    {
                        "post_id": "1",
                        "post_link": "https://commons.commondreams.org/t/decades-of-disaster-biden-is-right-to-end-the-war-in-afghanistan/131192",
                        "post_author": "CommonDreams",
                        "post_author_link": "https://commons.commondreams.org/u/CommonDreams",
                        "post_description": "Originally published at: Decades of Disaster: Biden Is Right to End the War in Afghanistan",
                        "post_description_links": [
                            "https://www.commondreams.org/node/329910"
                        ],
                        "post_replies": "0 Reply",
                        "post_likes": "0",
                        "linked_posts": []
                    },
                    {
                        "post_id": "2",
                        "post_link": "https://commons.commondreams.org/t/decades-of-disaster-biden-is-right-to-end-the-war-in-afghanistan/131192/2",
                        "post_author": "Aleph_Null",
                        "post_author_link": "https://commons.commondreams.org/u/Aleph_Null",
                        "post_description": "Peter Certo quotes something Biden said which has been troubling me:\n“If Afghanistan is unable to mount any real resistance to the Taliban now,” Biden said, “there is no chance that one more year, five more years, or 20 more years of U.S. military boots on the ground would have made any difference.”\nThat, in various forms, has been repeated over and over: Those consarn lazy-ass Afghans, if they’re not willing to fight for their own country, why should we? Does this messaging sound the slightest bit contemptuous, possibly racist-slash-Islamophobic, to anyone else?\nIt should be perfectly clear to all by now: Afghans don’t resist Taliban because they regard Taliban as Afghan. Couldn’t be much simpler. Why twist it into this distorted picture of Afghan weakness, corruption, or incompetence? Doesn’t such an attitude risk piling on with more recklessly scattershot contempt for a proud people?",
                        "post_description_links": [],
                        "post_replies": "2 Replies",
                        "post_likes": "2",
                        "linked_posts": []
                    },
                    {
                        "post_id": "3",
                        "post_link": "https://commons.commondreams.org/t/decades-of-disaster-biden-is-right-to-end-the-war-in-afghanistan/131192/3",
                        "post_author": "Zappaz",
                        "post_author_link": "https://commons.commondreams.org/u/Zappaz",
                        "post_description": "Peter Certo wrote: \" When the president took off with a helicopter full of cash, many Afghan soldiers sensibly concluded it wasn’t worth dying for any longer.”\nI doubt that the collapse started so late. Biden fails to have empathy with the Afghan soldier. As Master Sun’s Art of War points out, integrity of a nation at war depends on the leader convincing everybody of a powerful mission statement. Soldiers must believe in their mission, and belief and trust must be both solid and flexible up and down the line of command. If I believe that my squad leader works for my benefit and our common cause, that belief has to entail a belief that at all points in the line of command there are people who are behind me and behind every soldier.\nI think the reality, as the average Afghan soldier saw it, was that the real line of “having my back,” went through Americans they had direct contact with. What was left for this soldier if the USA pulled out?\nMy belief is that a nation and/or an army cannot successfully be imposed from outside. It must develop organically, from within the people. How did George Washington manage to get a real army out of former colonials, most of whom probably only knew what they didn’t want. What made an apprentice miller boy into a soldier and kept him in that role?",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "1",
                        "linked_posts": []
                    },
                    {
                        "post_id": "4",
                        "post_link": "https://commons.commondreams.org/t/decades-of-disaster-biden-is-right-to-end-the-war-in-afghanistan/131192/4",
                        "post_author": "advocate22",
                        "post_author_link": "https://commons.commondreams.org/u/advocate22",
                        "post_description": "Certo has it right.",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "1",
                        "linked_posts": []
                    },
                    {
                        "post_id": "5",
                        "post_link": "https://commons.commondreams.org/t/decades-of-disaster-biden-is-right-to-end-the-war-in-afghanistan/131192/5",
                        "post_author": "BigB",
                        "post_author_link": "https://commons.commondreams.org/u/BigB",
                        "post_description": "While we of course should be leaving Afghanistan (shouldn’t have been there in first place) it is plainly obvious that we could not have done it in a more haphazard way. Jeebus on a cracker! Who is running things at the State dept and Pentagon these days, the Marx brothers? “Sorry everybody, but after 20 years you have 5 minutes to pack your bags and get to the airport. Where are we taking you? We’ll figure that out once we get in the air….”\nWhile there was probably no good way to exit Afghanistan after all this time, we didn’t need to turn it in to a crappy community theater version of the fall of Saigon.\nAnd now, matters are worse. Another wave of Covid is hitting the US. The economy is still sluggish. Gerrymandering has begun in earnest in key battleground states, and now old uncle Joe Biden and his equally feeble acolytes have decided that what the Democratic Party really needed at this time of crisis is another Bay of Pigs fiasco.\nOnward to 2022……",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "1",
                        "linked_posts": []
                    }
                ]
            },
            {
                "topic_details": {
                    "topic_title": "Adding to US Failures in Afghanistan, Taliban Have Grabbed Billions in Weaponry",
                    "topic_id": "131219",
                    "topic_url": "https://commons.commondreams.org/t/adding-to-us-failures-in-afghanistan-taliban-have-grabbed-billions-in-weaponry/131219",
                    "topic_author": "CommonDreams",
                    "topic_author_link": "https://commons.commondreams.org/u/CommonDreams",
                    "created_timestamp": "Aug 19, 2021 11:38 pm",
                    "replies": "4",
                    "views": "28",
                    "users": "5",
                    "likes": "2",
                    "popular_links_attached": []
                },
                "posts": [
                    {
                        "post_id": "1",
                        "post_link": "https://commons.commondreams.org/t/adding-to-us-failures-in-afghanistan-taliban-have-grabbed-billions-in-weaponry/131219",
                        "post_author": "CommonDreams",
                        "post_author_link": "https://commons.commondreams.org/u/CommonDreams",
                        "post_description": "Originally published at: Adding to US Failures in Afghanistan, Taliban Have Grabbed Billions in Weaponry",
                        "post_description_links": [
                            "https://www.commondreams.org/news/2021/08/19/taliban-has-grabbed-billions-us-weaponry"
                        ],
                        "post_replies": "0 Reply",
                        "post_likes": "0",
                        "linked_posts": []
                    },
                    {
                        "post_id": "2",
                        "post_link": "https://commons.commondreams.org/t/adding-to-us-failures-in-afghanistan-taliban-have-grabbed-billions-in-weaponry/131219/2",
                        "post_author": "Aleph_Null",
                        "post_author_link": "https://commons.commondreams.org/u/Aleph_Null",
                        "post_description": "I shouldn’t post at moments like this, but it’s possible some readers of the Commons have been wondering if it’s even possible: I’m at a loss for words, struck dumb!",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "1",
                        "linked_posts": []
                    },
                    {
                        "post_id": "3",
                        "post_link": "https://commons.commondreams.org/t/adding-to-us-failures-in-afghanistan-taliban-have-grabbed-billions-in-weaponry/131219/3",
                        "post_author": "oldie",
                        "post_author_link": "https://commons.commondreams.org/u/oldie",
                        "post_description": "Taliban have cut off trade with India. Another point that Pakistan army officers are leading the taliban strategy and tactics. No one can control the young taliban goon out on the street tormenting all others.\nThe saddest story of leaving behind the afghan peoples who assisted us out in the countryside cannot be fixed. We have no way to help them travel past check points and avoid capture and death. Taliban are now and will revenge.\naccurate news = Reuters dot com",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "0",
                        "linked_posts": []
                    },
                    {
                        "post_id": "4",
                        "post_link": "https://commons.commondreams.org/t/adding-to-us-failures-in-afghanistan-taliban-have-grabbed-billions-in-weaponry/131219/4",
                        "post_author": "TrumpTowerofBabel",
                        "post_author_link": "https://commons.commondreams.org/u/TrumpTowerofBabel",
                        "post_description": "Well now the USA will have to purchase a whole new set of weaponry to replace the ones they left behind. The military merchandise merry-go-round goes round and round and round… I can just picture the war profiteers in their board rooms laughing and slapping each other’s backs.",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "1",
                        "linked_posts": []
                    },
                    {
                        "post_id": "5",
                        "post_link": "https://commons.commondreams.org/t/adding-to-us-failures-in-afghanistan-taliban-have-grabbed-billions-in-weaponry/131219/5",
                        "post_author": "k3nnyw33ks",
                        "post_author_link": "https://commons.commondreams.org/u/k3nnyw33ks",
                        "post_description": "I know some people think everybody should have a gun, but this is going too far.",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "0",
                        "linked_posts": []
                    }
                ]
            },
            {
                "topic_details": {
                    "topic_title": "US Urged to Aid Afghan Journalists Seeking Safe Passage Amid Reports of Taliban Beatings",
                    "topic_id": "131193",
                    "topic_url": "https://commons.commondreams.org/t/us-urged-to-aid-afghan-journalists-seeking-safe-passage-amid-reports-of-taliban-beatings/131193",
                    "topic_author": "CommonDreams",
                    "topic_author_link": "https://commons.commondreams.org/u/CommonDreams",
                    "created_timestamp": "Aug 19, 2021 1:31 am",
                    "replies": "26",
                    "views": "136",
                    "users": "15",
                    "likes": "53",
                    "popular_links_attached": []
                },
                "posts": [
                    {
                        "post_id": "1",
                        "post_link": "https://commons.commondreams.org/t/us-urged-to-aid-afghan-journalists-seeking-safe-passage-amid-reports-of-taliban-beatings/131193",
                        "post_author": "CommonDreams",
                        "post_author_link": "https://commons.commondreams.org/u/CommonDreams",
                        "post_description": "Originally published at: US Urged to Aid Afghan Journalists Seeking Safe Passage Amid Reports of Taliban Beatings",
                        "post_description_links": [
                            "https://www.commondreams.org/news/2021/08/18/us-urged-aid-afghan-journalists-seeking-safe-passage"
                        ],
                        "post_replies": "0 Reply",
                        "post_likes": "2",
                        "linked_posts": []
                    },
                    {
                        "post_id": "2",
                        "post_link": "https://commons.commondreams.org/t/us-urged-to-aid-afghan-journalists-seeking-safe-passage-amid-reports-of-taliban-beatings/131193/2",
                        "post_author": "oldie",
                        "post_author_link": "https://commons.commondreams.org/u/oldie",
                        "post_description": "This story is about 300 journalists.\nThe story should be that USA is too darn slow with flights out of Afghan.\n10,000 to 15,000 Americans who previously were told to leave and arrogantly did not.\nTrainers, mercenaries, merchants galore. Now, we have DC telling us that it is our moral obligation to save each one. Three generations ago, those reluctants would not have sympathy.\nGen’l Miley at today’s 3pm eastern explanation only lied twice. Which is normal by dod.\nRamp up evacuation daily counts?\nFor heavens sake, in four or five days we cannot flex our Air Force transport schedules to work this evacuation? Waiting for contract air carriers!!!\nLeft unsaid, how do we reach out and protect the translators and their families from taliban deadly retribution’s. These folks are all over afghan.\nHow do we fly them out.\nLast: how do we punish Pakistan for their supporting the taliban all these years. ???",
                        "post_description_links": [],
                        "post_replies": "2 Replies",
                        "post_likes": "1",
                        "linked_posts": []
                    },
                    {
                        "post_id": "3",
                        "post_link": "https://commons.commondreams.org/t/us-urged-to-aid-afghan-journalists-seeking-safe-passage-amid-reports-of-taliban-beatings/131193/3",
                        "post_author": "Joey",
                        "post_author_link": "https://commons.commondreams.org/u/Joey",
                        "post_description": "“reporter and photographer covering an anti-Taliban [protest] in Jalalabad were beaten by Taliban fighters, who opened fire on demonstrators, reportedly killing three people.”\nShould Read:\nreporter and photographer covering an anti-Trump [protest] in Portland were beaten by Portland PD, who opened fire on demonstrators, reportedly killing three people.",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "5",
                        "linked_posts": []
                    },
                    {
                        "post_id": "7",
                        "post_link": "https://commons.commondreams.org/t/us-urged-to-aid-afghan-journalists-seeking-safe-passage-amid-reports-of-taliban-beatings/131193/7",
                        "post_author": "JimHeilbrecht",
                        "post_author_link": "https://commons.commondreams.org/u/JimHeilbrecht",
                        "post_description": "There are many similarities between the Afghan Taliban and America’s Christian Taliban, including:\nThey both hate journalists\nThey both seek to subjugate women.\nThey both believe in the same invisible sky daddy (albeit with different names for the deity).\nThey both are gun nuts.\nThey both favor violent authoritarianism.\nThey both favor violent overthrow of government.\nThey both are are anti-science and primitive.\nThey both are uneducated and patriarchal.\nThey both lie constantly.\nThey both seek theocracy.\nThey both use social media propaganda.\nThey both are anti-vaccine.\nIf you hate and fear the Afghan Taliban, you should feel the same towards the American version.",
                        "post_description_links": [],
                        "post_replies": "2 Replies",
                        "post_likes": "4",
                        "linked_posts": []
                    },
                    {
                        "post_id": "8",
                        "post_link": "https://commons.commondreams.org/t/us-urged-to-aid-afghan-journalists-seeking-safe-passage-amid-reports-of-taliban-beatings/131193/8",
                        "post_author": "Umatilla2_Jones",
                        "post_author_link": "https://commons.commondreams.org/u/Umatilla2_Jones",
                        "post_description": "Name one thing good about America.\nCharlie Parker. Ok. Who else? Ok, maybe Tom Waits.\nWest of the Rockies will be a desert in 15 years. Both the air and the ocean are full of plastic. The peyote might all get eaten. Then what?",
                        "post_description_links": [],
                        "post_replies": "1 Reply",
                        "post_likes": "2",
                        "linked_posts": []
                    }
                ]
            },
            {
                "topic_details": {
                    "topic_title": "Experts Warn Rich Nations’ Push for Boosters Could Lock in Vaccine ‘Apartheid’",
                    "topic_id": "131212",
                    "topic_url": "https://commons.commondreams.org/t/experts-warn-rich-nations-push-for-boosters-could-lock-in-vaccine-apartheid/131212",
                    "topic_author": "CommonDreams",
                    "topic_author_link": "https://commons.commondreams.org/u/CommonDreams",
                    "created_timestamp": "Aug 19, 2021 9:24 pm",
                    "replies": "10",
                    "views": "63",
                    "users": "10",
                    "likes": "9",
                    "popular_links_attached": []
                },
                "posts": [
                    {
                        "post_id": "1",
                        "post_link": "https://commons.commondreams.org/t/experts-warn-rich-nations-push-for-boosters-could-lock-in-vaccine-apartheid/131212",
                        "post_author": "CommonDreams",
                        "post_author_link": "https://commons.commondreams.org/u/CommonDreams",
                        "post_description": "Originally published at: Experts Warn Rich Nations’ Push for Boosters Could Lock in Vaccine ‘Apartheid’",
                        "post_description_links": [
                            "https://www.commondreams.org/news/2021/08/19/humanitarian-disaster-experts-warn-push-boosters-could-lock-vaccine-apartheid"
                        ],
                        "post_replies": "0 Reply",
                        "post_likes": "4",
                        "linked_posts": []
                    },
                    {
                        "post_id": "2",
                        "post_link": "https://commons.commondreams.org/t/experts-warn-rich-nations-push-for-boosters-could-lock-in-vaccine-apartheid/131212/2",
                        "post_author": "raydelcamino",
                        "post_author_link": "https://commons.commondreams.org/u/raydelcamino",
                        "post_description": "The solution:\nReduce the amount of military industrial media infotainment complex (MIMIC) corporate welfare that Congress serially doles out and redirect those funds to making more doses that are sent to other nations AND provide boosters for murkins.",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "1",
                        "linked_posts": []
                    },
                    {
                        "post_id": "3",
                        "post_link": "https://commons.commondreams.org/t/experts-warn-rich-nations-push-for-boosters-could-lock-in-vaccine-apartheid/131212/3",
                        "post_author": "august",
                        "post_author_link": "https://commons.commondreams.org/u/august",
                        "post_description": "“Many CD commenters have never been in politics or any situation where 15-dimensional chess is required.”\n~JimHeilbrecht\nThis must be an example of Biden & Company’s 15-dimensional chess strategy. Always thinking ahead, huh Joe?",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "1",
                        "linked_posts": []
                    },
                    {
                        "post_id": "4",
                        "post_link": "https://commons.commondreams.org/t/experts-warn-rich-nations-push-for-boosters-could-lock-in-vaccine-apartheid/131212/4",
                        "post_author": "rickshaw51",
                        "post_author_link": "https://commons.commondreams.org/u/rickshaw51",
                        "post_description": "the American version of extreme science denial–as if we lived in a world not connected to every place else",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "1",
                        "linked_posts": []
                    },
                    {
                        "post_id": "5",
                        "post_link": "https://commons.commondreams.org/t/experts-warn-rich-nations-push-for-boosters-could-lock-in-vaccine-apartheid/131212/5",
                        "post_author": "ridgewalker1",
                        "post_author_link": "https://commons.commondreams.org/u/ridgewalker1",
                        "post_description": "Bullshit!",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "1",
                        "linked_posts": []
                    }
                ]
            },
            {
                "topic_details": {
                    "topic_title": "‘A Big Win’: USPS Must Turn Over Docs About DeJoy’s Potential Conflicts of Interest",
                    "topic_id": "131201",
                    "topic_url": "https://commons.commondreams.org/t/a-big-win-usps-must-turn-over-docs-about-dejoys-potential-conflicts-of-interest/131201",
                    "topic_author": "CommonDreams",
                    "topic_author_link": "https://commons.commondreams.org/u/CommonDreams",
                    "created_timestamp": "Aug 19, 2021 4:31 am",
                    "replies": "5",
                    "views": "315",
                    "users": "6",
                    "likes": "9",
                    "popular_links_attached": []
                },
                "posts": [
                    {
                        "post_id": "1",
                        "post_link": "https://commons.commondreams.org/t/a-big-win-usps-must-turn-over-docs-about-dejoys-potential-conflicts-of-interest/131201",
                        "post_author": "CommonDreams",
                        "post_author_link": "https://commons.commondreams.org/u/CommonDreams",
                        "post_description": "Originally published at: ‘A Big Win’: USPS Must Turn Over Docs About DeJoy’s Potential Conflicts of Interest 5",
                        "post_description_links": [
                            "https://www.commondreams.org/news/2021/08/18/judge-postmaster-general-dejoy-must-hand-over-documents-regarding-potential"
                        ],
                        "post_replies": "0 Reply",
                        "post_likes": "2",
                        "linked_posts": []
                    },
                    {
                        "post_id": "2",
                        "post_link": "https://commons.commondreams.org/t/a-big-win-usps-must-turn-over-docs-about-dejoys-potential-conflicts-of-interest/131201/2",
                        "post_author": "stardustIBID",
                        "post_author_link": "https://commons.commondreams.org/u/stardustIBID",
                        "post_description": "Perhaps… finally,\nTHERE WILL BE JOY IN MAILVILLE------\nfor the disgusting, lying, cheating UNAmerican creep\nHAS STRUCK OUT\nPLEASE—may we stick him in a mail bag and send him off to SIBERIA?\nAlthough—the methane might get to him before we could celebrate.: )",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "3",
                        "linked_posts": []
                    },
                    {
                        "post_id": "3",
                        "post_link": "https://commons.commondreams.org/t/a-big-win-usps-must-turn-over-docs-about-dejoys-potential-conflicts-of-interest/131201/3",
                        "post_author": "JimHeilbrecht",
                        "post_author_link": "https://commons.commondreams.org/u/JimHeilbrecht",
                        "post_description": "It will be a BIG WIN only when DeJoyless and all his cronies are sentenced to life terms in federal prison. The list of his crimes are long, especially since he sabotaged the mail system to help Trump steal the election, and is guilty of insider trading.\nHow it can be that Biden can’t fire him and all his conspirators is beyond me, but he needs to be behind bars in a supermax.",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "0",
                        "linked_posts": []
                    },
                    {
                        "post_id": "4",
                        "post_link": "https://commons.commondreams.org/t/a-big-win-usps-must-turn-over-docs-about-dejoys-potential-conflicts-of-interest/131201/4",
                        "post_author": "rickshaw51",
                        "post_author_link": "https://commons.commondreams.org/u/rickshaw51",
                        "post_description": "I am not holding my breath --the destruction of USPS is a bipartisan effort made on behalf of the for profit carriers perpetrated by their political minions for the campaign bribes–ah --contributions",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "4",
                        "linked_posts": []
                    },
                    {
                        "post_id": "5",
                        "post_link": "https://commons.commondreams.org/t/a-big-win-usps-must-turn-over-docs-about-dejoys-potential-conflicts-of-interest/131201/5",
                        "post_author": "ridgewalker1",
                        "post_author_link": "https://commons.commondreams.org/u/ridgewalker1",
                        "post_description": "Remove this jackass asap.",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "0",
                        "linked_posts": []
                    }
                ]
            }
        ]
    },
    {
        "category": {
            "category_name": "FAQ",
            "category_description": "Discussion about this site, its organization, how it works, and how we can improve it.",
            "category_link": "https://commons.commondreams.org/c/meta/3",
            "num_topics": "2"
        },
        "topics": [
            {
                "topic_details": {
                    "topic_title": "How to navigate The Commons",
                    "topic_id": "3481",
                    "topic_url": "https://commons.commondreams.org/t/how-to-navigate-the-commons/3481",
                    "topic_author": "CommonDreams",
                    "topic_author_link": "https://commons.commondreams.org/u/CommonDreams",
                    "created_timestamp": "Feb 4, 2015 9:16 am",
                    "replies": "1",
                    "views": "2961",
                    "users": "1",
                    "likes": "4",
                    "popular_links_attached": []
                },
                "posts": [
                    {
                        "post_id": "1",
                        "post_link": "https://commons.commondreams.org/t/how-to-navigate-the-commons/3481",
                        "post_author": "CommonDreams",
                        "post_author_link": "https://commons.commondreams.org/u/CommonDreams",
                        "post_description": "Thanks for joining our community at The Commons, and welcome!\nHere are a few quick tips to get you started and to help you along the way:\nThis private message has a few quick tips to get you started.\nKeep scrolling\nThere are no next page buttons or page numbers – to read more, just keep scrolling down!\nAs new comments come in, they will appear automatically.\nWhere am I?\nFor search, your user page, or the menu, use the icon\n☰\nbuttons at the upper right.\nAny article title will take you to the next unread comment. Use the last activity time and comment count to enter at the top or bottom.\nWhile reading a comments on an article, jump to the top ↑ by selecting the article title. Select the green progress bar at the bottom right for full navigation controls, or use the\nhome\nand\nend\nkeys.\nHow do I reply?\nTo reply to the overall article, use the Reply button at the very bottom of the page.\nTo reply to a specific comment, use the Reply button on that comment.\nTo quote someone in your reply, select the text you wish to quote, then press any Reply button.\nTo ping someone in your reply, mention their name. Type @ and an autocompleter will pop up.\nFor standard Emoji 7, just start typing : or the traditional smileys :)\nWhat else can I do?\nThere are action buttons at the bottom of each comment.\nTo let someone know that you enjoyed their comment, use the like button. If you see a problem with a comment, please let our staff know about it by using the flag button or, if you wish, privately message the commenter with your concerns.\nYou can also share a link to a comment or bookmark it for later reference - it will be saved on your personal user page.\n##Can I see my commenting history?##\nYes, your comments, along with likes and replies, are stored on your personal profile page. Live notifications will let you know whenever someone has replied or interacted with your comment.\n##The comments aren’t threaded. How can I tell if someone has replied to my comment? Or if a comment is a response to something else?##\nYou can see all the replies to comments by clicking “replies”, as you can see here:\nWho is talking to me?\nWhen someone replies to your comment, quotes your comment, or mentions your @username, a number will immediately appear at the top right of your page. Use it access your notifications.\nDon’t worry about missing a reply – you’ll be emailed direct replies (and private messages) if you aren’t online when they arrive.\nWhen are conversations new?\nBy default all conversations less than two days old are considered new, and any conversation you’ve participated in (replied to, created, or read for an extended period) will automatically be tracked.\nYou will see the blue new and number indicators next to these articles:\nYou can change the individual notification state of an article’s discussion via the control at the bottom of the article discussion (this can also be set per category). To change how you track articles, or the definition of new, see your user preferences.\nWhy can’t I do certain things?\nNew users are somewhat limited for safety reasons as we build our new community. For example, most spammers and fly-by trolls post links or images then move on. Thus, new users cannot post links or images at first.\nAs you participate here - by reading, liking, sharing, and commenting, you’ll gain the trust of the community, and become a full citizen, and those limitations will automatically be removed. At a high enough trust level, you’ll gain even more abilities to help us manage our community together.\nWe believe in civilized community behavior at all times.\nEnjoy your stay!",
                        "post_description_links": [
                            "https://commons.commondreams.org/my/preferences",
                            "http://www.emoji.codes/",
                            "https://sea1.discourse-cdn.com/commondreams/images/welcome/progress-bar.png",
                            "https://sea1.discourse-cdn.com/commondreams/images/welcome/username-completion.png",
                            "https://sea1.discourse-cdn.com/commondreams/images/welcome/reply-topic.png",
                            "https://emoji.discourse-cdn.com/twitter/smile.png?v=9",
                            "https://sea1.discourse-cdn.com/commondreams/images/welcome/notification-panel.png",
                            "https://sea1.discourse-cdn.com/commondreams/images/welcome/like-link-flag-bookmark.png",
                            "https://commons.commondreams.org/uploads/commondreams/153/2320612b73785585.jpg",
                            "https://sea1.discourse-cdn.com/commondreams/images/welcome/topics-new-unread.png",
                            "https://commons.commondreams.org/uploads/commondreams/151/122102289a9dffcd.jpg",
                            "https://sea1.discourse-cdn.com/commondreams/images/welcome/reply-post.png",
                            "https://sea1.discourse-cdn.com/commondreams/images/welcome/quote-reply.png"
                        ],
                        "post_replies": "0 Reply",
                        "post_likes": "4",
                        "linked_posts": []
                    }
                ]
            },
            {
                "topic_details": {
                    "topic_title": "The Community Guidelines",
                    "topic_id": "3482",
                    "topic_url": "https://commons.commondreams.org/t/the-community-guidelines/3482",
                    "topic_author": "CommonDreams",
                    "topic_author_link": "https://commons.commondreams.org/u/CommonDreams",
                    "created_timestamp": "Feb 4, 2015 9:19 am",
                    "replies": "1",
                    "views": "2733",
                    "users": "1",
                    "likes": "6",
                    "popular_links_attached": []
                },
                "posts": [
                    {
                        "post_id": "1",
                        "post_link": "https://commons.commondreams.org/t/the-community-guidelines/3482",
                        "post_author": "CommonDreams",
                        "post_author_link": "https://commons.commondreams.org/u/CommonDreams",
                        "post_description": "Can’t We All Get Along?\nThis is a Civilized Place for Public Discussion\nPlease treat this discussion forum with the same respect you would a public park. We, too, are a shared community resource — a place to share skills, knowledge and interests through ongoing conversation. These are not hard and fast rules, merely aids to the human judgment of our community. Use these guidelines to keep this a clean, well-lighted place for civilized public discourse.\nImprove the Discussion\nHelp us make this a great place for discussion by always working to improve the discussion in some way, however small. If you are not sure your post adds to the conversation, think over what you want to say and try again later. The topics discussed here matter to us, and we want you to act as if they matter to you, too. Be respectful of the topics and the people discussing them, even if you disagree with some of what is being said.\nBe Agreeable, Even When You Disagree\nYou may wish to respond to something by disagreeing with it. That’s fine. But, remember to criticize ideas, not people. Please avoid: Name-calling. Ad hominem attacks. Responding to a post’s tone instead of its actual content. Knee-jerk contradiction. Instead, provide reasoned counter-arguments that improve the conversation.\nBe Nice to Our Writers, Even When They Piss You Off\nOur contributing writers put their ideas and opinions into the public sphere using their real identities - not anonymous screen names. You may agree or disagree strongly with their ideas and we are providing you a forum to debate them. But any posters making personal attacks on our contributing writers will not be welcome in our community.\nOne Person, One Voice\nAll are welcome in our community. We believe that communities where people take a stand by speaking out using their real names are the healthiest communities. We understand that some need to remain anonymous for professional or personal reasons and we will allow for that. However, anyone attempting to use multiple screen names or log-ins is not welcome here. One person, one voice.\nYour Participation Counts\nThe conversations we have here set the tone for everyone. Help us influence the future of this community by choosing to engage in discussions that make this forum an interesting place to be — and avoiding those that do not. The Commons provides tools that enable the community to collectively identify the best (and worst) contributions: favorites, bookmarks, likes, flags, replies, edits, and so forth. Use these tools to improve your own experience, and everyone else’s, too. Let’s try to leave our park better than we found it.\nIf You See a Problem, Flag It\nModerators have special authority; they are responsible for keeping this forum civil. But so are you. With your help, moderators can be community facilitators, not just janitors or police. When you see bad behavior, don’t reply. It encourages the bad behavior by acknowledging it, consumes your energy, and wastes everyone’s time. Just flag it. If enough flags accrue, action will be taken, either automatically or by moderator intervention. In order to maintain our community, moderators reserve the right to remove any content and any user account for any reason at any time. Moderators do not preview new posts in any way; the moderators and site operators take no responsibility for any content posted by the community.\nAlways Be Civil\nNothing sabotages a healthy conversation like rudeness: Be civil. Don’t post anything that a reasonable person would consider offensive, abusive, or hate speech. Keep it clean. Don’t post anything obscene or sexually explicit. Respect each other. Don’t harass or grief anyone, impersonate people, or expose their private information. Respect our forum. Don’t post spam or otherwise vandalize the forum. These are not concrete terms with precise definitions — avoid even the appearance of any of these things. If you’re unsure, ask yourself how you would feel if your post was featured on the front page of the New York Times. This is a public forum, and search engines index these discussions. Keep the language, links, and images safe for family and friends.\nKeep It Tidy\nMake the effort to put things in the right place, so that we can spend more time discussing and less cleaning up. So: Don’t cross-post the same thing in multiple topics. Don’t post no-content replies. Don’t divert a discussion by changing it midstream. Don’t sign your posts — every post has your profile information attached to it. Rather than posting “+1” or “Agreed”, use the Like button.\nPost Only Your Own Stuff\nYou may not post anything digital that belongs to someone else without permission. You may not post descriptions of, links to, or methods for stealing someone’s intellectual property (software, video, audio, images), or for breaking any other law.",
                        "post_description_links": [],
                        "post_replies": "0 Reply",
                        "post_likes": "6",
                        "linked_posts": []
                    }
                ]
            }
        ]
    }
]