{
    "topic_details": {
        "id": 131897,
        "categeory_id": 5,
        "title": "Critics Warn Biden That 30% Methane Reduction by 2030 Not Good Enough",
        "url": "https://commons.commondreams.org/t/critics-warn-biden-that-30-methane-reduction-by-2030-not-good-enough/131897",
        "slug": "critics-warn-biden-that-30-methane-reduction-by-2030-not-good-enough",
        "tags": [],
        "posts_count": 8,
        "created_timestamp": "2021-09-17T19:22:59.819Z",
        "views": 179,
        "reply_count": 1,
        "like_count": 8
    },
    "posts": [
        {
            "id": 1142025,
            "post_number": 1,
            "url": "https://commons.commondreams.org/t/critics-warn-biden-that-30-methane-reduction-by-2030-not-good-enough/131897/1",
            "author": {
                "username": "CommonDreams",
                "name": "Common Dreams",
                "user_id": 24,
                "url": "https://commons.commondreams.org/t/u/CommonDreams"
            },
            "links": [
                {
                    "title": "",
                    "url": "https://www.commondreams.org/news/2021/09/17/us-ue-pledge-cut-methane-emissions-30-2030-should-be-much-stronger",
                    "type": "blog",
                    "clicks": 1,
                    "description": " Jessica Corbett\nAdvocates of addressing the root causes of the global climate emergency on Friday called the United States and European Union's new pledge to reduce methane emissions at least 30% by 2030 a step in the right direction but still lacking in both necessary ambition and specifics.\n\"Instead of merely pledging to do better, governments around the world must put an end to the drilling and fracking that is fueling the climate emergency.\"—Wenonah Hauter, Food & Water Watch\n\"While it is encouraging to see governments' pledge to take serious action, the emissions target should be much stronger,\" said Food & Water Watch executive director Wenonah Hauter in a statement. \"We know that more aggressive cuts in methane are well within reach over the next decade, and are necessary in order to deal with the climate crisis.\"\nMeaningful climate action, including any methane reduction plans, \"must be rooted in a rapid shift away from fossil fuels,\" Hauter argued. \"The Biden administration can and must stop all new fossil fuel projects, including an end to dirty energy exploitation of our public lands.\"\n\"We have known for years that the fracking boom—cheered on by so many political leaders—is creating an increase in methane emissions, water contamination, and air pollution,\" she added. \"Instead of merely pledging to do better, governments around the world must put an end to the drilling and fracking that is fueling the climate emergency.\"\nHauter also highlighted concerns about gauging progress, given that bodies such as the U.S. Environmental Protection Agency \"have continually underestimated methane emissions,\" and emphasized that such targets should not include a \"so-called solution\" like factory farm biogas, explaining that \"these schemes seek to entrench harmful industrial agriculture practices, or to even encourage their expansion under the guise of climate action.\"\nShefali Sharma, director of the Institute for Agriculture and Trade Policy (IATP) European office, echoed Hauter's warning about such pratices, saying in a statement that \"techno-fixes such as new feed additives and factory farm gas (or biogas digesters) are Band-Aids on a broken system of rising animal numbers, more methane, and air, land, and water pollution.\"\n\"The E.U. has missed a major opportunity in its recently finalized Common Agriculture Policy (CAP) revision to tackle methane,\" Sharma added. \"It should ensure that its climate package and methane strategy don’t make the same mistake. These policies must help European agriculture transition to agroecological practices rather than incentivizing industrial systems.\"\nMultiple analyses this month have detailed industrial agriculture's contributions to global heating, particularly due to methane, which is up to 87 times more potent than carbon dioxide over a 20-year period. IATP is urging all countries to \"begin to appropriately regulate livestock emissions and redirect public funds to support farmers in a just transition towards biodiverse, agroecological systems.\"\nBen Lilliston, IATP's director of rural strategies and climate change, said his group and other allies defending family farmers and the environment are calling on the Biden administration to tackle factory farm emissions by enforcing the Clean Air Act.\n\"Real action on methane,\" Lilliston said, \"must include a transition away from factory farms toward less emitting, agroecological systems.\"\nU.S. President Joe Biden formally unveiled the methane goal—reported by Reuters earlier this week—during a Friday meeting with leaders of other major economies, a follow-up to his April climate summit. Biden said the effort to cut methane emissions 30% this decade, relative to 2020, \"will not only rapidly reduce the rate of global warming, but it will also produce a very valuable side benefit, like improving public health and agricultural output.\"\nThe Biden administration—which in April announced its aim to halve overall U.S. emissions by 2030—has faced mounting pressure to specifically address methane since its impact on the planet was flagged in the latest United Nations' Intergovernmental Panel on Climate Change report. Earthworks policy director Lauren Pagel last month urged the U.S. president to \"cut oil and gas methane pollution 65% by 2025.\"\nRepeating that call Friday, Pagel said that the new pledge \"marks the first international government commitment specific to reducing methane climate pollution, but words are not enough. President Biden has an immediate opportunity to show he means what he says by directing the EPA to issue the strongest rules possible under the Clean Air Act to cut methane pollution from oil and gas production.\"\nKelly Sheehan Martin, senior director of energy campaigns at the Sierra Club, said Friday that \"Biden must commit to even stronger methane reduction targets, stop subsidizing fossil fuels, and make clean, renewable energy available to all of our families and communities, especially those already overburdened by harmful pollution.\"\nBiden's confirmation of the new goal came as another U.N. report—released Friday in anticipation of COP 26, a global climate summit that kicks off October 31—reiterated the necessity of all nations ramping up efforts to cut planet-heating pollution. The analysis of countries' Paris agreement pledges projects a 16% increase in global emissions for 2030, compared to 2010, and warns that the world's average temperature could rise 2.7°C by the end of the century, far beyond the 1.5°C target.\nDuring the Friday meeting, U.N. Secretary-General António Guterres reportedly warned world leaders that \"the world is on a catastrophic pathway\" to 2.7°C and \"we need a 45% cut in emissions by 2030 to reach carbon neutrality by mid-century.\" Those comments came day just a day after Guterres wrote in the foreword of yet another U.N. climate report that \"unless there are immediate, rapid, and large-scale reductions in greenhouse gas emissions, limiting warming to 1.5°C will be impossible.\"\n"
                }
            ],
            "desciription": "Originally published at: Critics Warn Biden That 30% Methane Reduction by 2030 Not Good Enough",
            "created_timestamp": "2021-09-17T19:22:59.867Z",
            "score": 189.8,
            "likes": 0,
            "reply_count": 0,
            "reply_to_post_number": null,
            "reads": 24,
            "readers_count": 23
        },
        {
            "id": 1142033,
            "post_number": 2,
            "url": "https://commons.commondreams.org/t/critics-warn-biden-that-30-methane-reduction-by-2030-not-good-enough/131897/2",
            "author": {
                "username": "nineteen50",
                "name": "jack",
                "user_id": 503,
                "url": "https://commons.commondreams.org/t/u/nineteen50"
            },
            "links": [],
            "desciription": "Why is it so hard to see the world is reaching critical limits of growth, both from a resource stand point and a pollution stand point. We can not sustain the current market capitalism that relies on infinite growth and consumption. Seems to me we need an economic system based on homeostasis rather than our current environmentally destructive market driven infinite growth paradigms of ever greater consumption.",
            "created_timestamp": "2021-09-17T19:37:33.423Z",
            "score": 49.6,
            "likes": 3,
            "reply_count": 0,
            "reply_to_post_number": null,
            "reads": 23,
            "readers_count": 22
        },
        {
            "id": 1142128,
            "post_number": 3,
            "url": "https://commons.commondreams.org/t/critics-warn-biden-that-30-methane-reduction-by-2030-not-good-enough/131897/3",
            "author": {
                "username": "TrumpTowerofBabel",
                "name": "Alan",
                "user_id": 22207,
                "url": "https://commons.commondreams.org/t/u/TrumpTowerofBabel"
            },
            "links": [],
            "desciription": "Try telling Mother Nature to reduce her methane releases. Fucking arrogant and oh so clever humans. We ain’t seen nothin’ yet. We are the frogs boiling to death.",
            "created_timestamp": "2021-09-18T00:53:49.423Z",
            "score": 22.8,
            "likes": 1,
            "reply_count": 0,
            "reply_to_post_number": null,
            "reads": 14,
            "readers_count": 13
        },
        {
            "id": 1142136,
            "post_number": 4,
            "url": "https://commons.commondreams.org/t/critics-warn-biden-that-30-methane-reduction-by-2030-not-good-enough/131897/4",
            "author": {
                "username": "PaulK",
                "name": "",
                "user_id": 1083,
                "url": "https://commons.commondreams.org/t/u/PaulK"
            },
            "links": [],
            "desciription": "I recommend that we flare every major natural methane source in the Arctic.  Tiny wind-powered and solar-powered sparking machines can light off the methane.  Methane is estimated to be 80 times as potent as the residual carbon dioxide, so flaring methane off where it has been concentrated has a meaning for humanity.\nThen, I recommend coating these areas, acre by acre, using wind-powered snow making machines in the Arctic spring, to change that acre of land’s albedo back to a natural snowy white.  This will cause the permafrost to refreeze in a very few years.  We want the 100 mph Arctic winds to spread the tiny snowflakes far and wide.\nThe entire job will be far less expensive than one Middle East oil war.\nLongtime readers know that I want demand for fracked natural gas reduced toward zero quickly with a few inventions.",
            "created_timestamp": "2021-09-18T01:22:40.226Z",
            "score": 22.6,
            "likes": 1,
            "reply_count": 0,
            "reply_to_post_number": null,
            "reads": 13,
            "readers_count": 12
        },
        {
            "id": 1142165,
            "post_number": 5,
            "url": "https://commons.commondreams.org/t/critics-warn-biden-that-30-methane-reduction-by-2030-not-good-enough/131897/5",
            "author": {
                "username": "bardamu",
                "name": "",
                "user_id": 1673,
                "url": "https://commons.commondreams.org/t/u/bardamu"
            },
            "links": [],
            "desciription": "Another problem with this sort of goal is that it amounts to planned failure.  The people who intend to reach that goal are not the people running the show.\nHave a look at prior ecological goals.  The perpetrators are in control, and have no intention of punishing themselves for blowing off tasks that the claim to follow for PR reasons.  All of this deadline business comes because the people performing the actions do not hold conformance as a goal. It won’t  happen.\nNo, government won’t do this. The point is not that it couldn’t, but that it will not.\nWe have to quit feeding the beast–cut it off as much as our own dependencies allow us, and then cut it back further from there.",
            "created_timestamp": "2021-09-18T05:55:49.862Z",
            "score": 37.2,
            "likes": 2,
            "reply_count": 0,
            "reply_to_post_number": null,
            "reads": 11,
            "readers_count": 10
        },
        {
            "id": 1142250,
            "post_number": 6,
            "url": "https://commons.commondreams.org/t/critics-warn-biden-that-30-methane-reduction-by-2030-not-good-enough/131897/6",
            "author": {
                "username": "F_DN",
                "name": "",
                "user_id": 6736,
                "url": "https://commons.commondreams.org/t/u/F_DN"
            },
            "links": [],
            "desciription": "Methane it was written is a ticking time bomb and the article that first identified and explained the problem was now written long ago … tic, tic, tic, tic, … .\nAh, but Joe, Joe is a kick the can down the road kind of guy and even worse he pure politician. Which means that even when he says or does something right, it’s always for the wrong reasons.",
            "created_timestamp": "2021-09-18T17:58:51.861Z",
            "score": 21.4,
            "likes": 1,
            "reply_count": 1,
            "reply_to_post_number": null,
            "reads": 7,
            "readers_count": 6
        },
        {
            "id": 1142257,
            "post_number": 7,
            "url": "https://commons.commondreams.org/t/critics-warn-biden-that-30-methane-reduction-by-2030-not-good-enough/131897/7",
            "author": {
                "username": "F_DN",
                "name": "",
                "user_id": 6736,
                "url": "https://commons.commondreams.org/t/u/F_DN"
            },
            "links": [],
            "desciription": "\n\n\n F_DN:\n\nand even worse he pure politician.\n\n\nhe’s",
            "created_timestamp": "2021-09-18T18:14:22.928Z",
            "score": 1.6,
            "likes": 0,
            "reply_count": 0,
            "reply_to_post_number": 6,
            "reads": 8,
            "readers_count": 7
        },
        {
            "id": 1142360,
            "post_number": 8,
            "url": "https://commons.commondreams.org/t/critics-warn-biden-that-30-methane-reduction-by-2030-not-good-enough/131897/8",
            "author": {
                "username": "rickshaw51",
                "name": "Rick Straw",
                "user_id": 22326,
                "url": "https://commons.commondreams.org/t/u/rickshaw51"
            },
            "links": [],
            "desciription": "if things continue as they have --when history (if we manage to survive our excesses) will report the Biden administration as one of \" too little --too late\" that failed the basic test of survival–change or die",
            "created_timestamp": "2021-09-19T11:21:40.539Z",
            "score": 6.0,
            "likes": 0,
            "reply_count": 0,
            "reply_to_post_number": null,
            "reads": 5,
            "readers_count": 4
        }
    ]
}